/* Subtitle for screen shown when credentials were added successfully. */
"ConnectionSuccess.Create.Subtitle" = "%@ on nyt yhdistetty onnistuneesti.";

/* Title for screen shown when credentials were added successfully. */
"ConnectionSuccess.Create.Title" = "Yhteyden muodostaminen onnistui";

/* Subtitle for screen shown when credentials were added successfully. */
"ConnectionSuccess.Update.Subtitle" = "%@-yhteyden päivitys onnistui.";

/* Title for screen shown when credentials were added successfully. */
"ConnectionSuccess.Update.Title" = "Päivitys onnistui";

/* Description shown in the concent information screen. */
"ConsentInformation.Description" = "Kun käytät tätä palvelua, keräämme sinua koskevia taloudellisia tietoja. Keräämme nämä sinua koskevat tiedot:";

/* Title shown in the concent information screen. */
"ConsentInformation.Title" = "Keräämme seuraavat sinua koskevat tiedot";

/* Description text for add credentials screen. */
"Credentials.Description" = "Kirjaudu sisään %@-palveluun, niin voit jatkaa";


/* Text explaining that the client will obtain financial information from the current user with a link for more information on which financial information specifically. */
"Credentials.ConsentText" = "%@ saa joitakin taloudellisia tietojasi. Lue lisää";
/* Title for action to continue adding credentials. */
"Credentials.Discard.ContinueAction" = "Jatka muokkaamista";

/* Title for action to discard adding credentials. */
"Credentials.Discard.PrimaryAction" = "Hylkää muutokset";

/* Title for action sheet presented when user tries to dismiss modal while adding credentials. */
"Credentials.Discard.Title" = "Haluatko varmasti hylätä nämä uudet tunnistetiedot?";

/* Title for error shown when authentication failed while adding credentials. */
"Credentials.Error.AuthenticationFailed" = "Todennus epäonnistui";

/* Message for error shown when credentials already exists. */
"Credentials.Error.CredentialsAlreadyExists" = "Olet jo yhdistänyt tähän pankkiin tai palveluun.";

/* Default title for error shown when download authentication app is required while adding credentials. */
"Credentials.Error.DownloadRequired" = "Todennussovellus on ladattava";

/* Title for error shown when a permanent failure occured while adding credentials. */
"Credentials.Error.PermanentFailure" = "Pysyvä virhe";

/* Title for error shown when a temporary failure occured while adding credentials. */
"Credentials.Error.TemporaryFailure" = "Tilapäinen virhe";

/* Instruction texts for credentials that need to redirect */
"Credentials.Instructions" = "1. Sinut ohjataan turvallisesti %@-palveluun.\n2. Sinua pyydetään todentamaan henkilöllisyytesi.\n3. Kun olet tehnyt todennuksen, sinut ohjataan takaisin.";

/* Text for BankID button shown in the add credentials/authenticate screen. */
"Credentials.OpenBankID" = "Avaa BankID";

/* Privacy policy clickable text used in Credentials.TermsAndConsentText. */
"Credentials.PrivacyPolicy" = "tietosuojakäytännön";


/* Read more text (clickable) to lead to consent information. */
"Credentials.ReadMore" = "Lue lisää";
/* Terms and conditions clickable text used in Credentials.TermsAndConsentText. */
"Credentials.TermsAndConditions" = "käyttöehdot";

/* Text explaining that when using the service, the user agrees to Tink's Terms and Conditions, Privacy Policy. And the text explaining that the client will obtain financial information from the current user with a link for more information on which financial information specifically. */
"Credentials.TermsAndConsentText" = "Palvelua käyttämällä hyväksyt Tinkin %1$@ ja %2$@. %3$@ saa joitakin taloudellisia tietojasi. %4$@";


/* Text explaining that when using the service, the user agrees to Tink's Terms and Conditions and Privacy Policy. */
"Credentials.TermsText" = "Palvelua käyttämällä hyväksyt Tinkin käyttöehdot ja tietosuojakäytännön.";
/* Title for add credentials/authenticate screen. */
"Credentials.Title" = "Henkilöllisyyden todentaminen";


/* Subtitle for screen shown when credentials were added successfully. */
"ConnectionSuccess.Subtitle" = "Tilisi yhdistäminen %@-palveluun onnistui.";

/* Title for screen shown when credentials were added successfully. */
"ConnectionSuccess.Title" = "Yhteyden muodostaminen onnistui";
/* Text for the warning shown when the developer is unverified. */
"Credentials.UnverifiedClient" = "Varmistamaton - Tämä ratkaisu on tehty vain kehitystarkoituksiin. Älä anna tunnistetietoja pankkiisi, jos et luota kehittäjään.";

/* View details text (clickable) to lead to consent information that used in Credentials.TermsAndConsentText. */
"Credentials.ViewDetails" = "Näytä tiedot";

/* Text shown for progress indicator dialog when in loading state. */
"CredentialsStatus.Authorizing" = "Valtuutetaan...";

/* Text shown for dialog when supplemental information is cancelled and waiting for credential status update. */
"CredentialsStatus.Cancelling" = "Peruutetaan...";

/* Text shown for dialog when supplemental information is submitted and waiting for credential status update. */
"CredentialsStatus.Sending" = "Lähetetään...";

/* Text shown for progress indicator dialog when status is CredentialStatus.Updating. */
"CredentialsStatus.Updating" = "Muodostetaan yhteyttä %@-palveluun, odota…";

/* Fallback text shown when fail to get bank name while updating credentials. */
"CredentialsStatus.UpdatingFallback" = "Muodostetaan yhteyttä, odota...";

/* Text shown when adding credentials and waiting for authentication on another device. */
"CredentialsStatus.WaitingForAuthenticationOnAnotherDevice" = "Odotetaan valtuutusta toisella laitteella";

/* Text for field validation error shown when text entered exceeds character limit. */
"Field.Validation.MaxLengthLimit" = "Tässä kentässä saa olla enintään %d merkkiä.";

/* Text for field validation error shown when text entered is shorter than required. */
"Field.Validation.MinLengthLimit" = "Tässä kentässä on oltava vähintään %d merkkiä.";

/* Text for field validation error shown when no text is entered for a required field. */
"Field.Validation.RequiredFieldEmptyValue" = "Tämä kenttä ei saa olla tyhjä.";

/* Text used to form a list. */
"Generic.And" = "ja";

/* Text shown for Cancel button. */
"Generic.Cancel" = "Peruuta";

/* Title for cancelled request. */
"Generic.Cancelled" = "Peruutettu";

/* Title for generic button to continue an action. */
"Generic.Continue" = "Jatka";

/* Title for action to dismiss error alert. */
"Generic.Dismiss" = "Hylkää";

/* Title for action to confirm an event. */
"Generic.Done" = "Valmis";

/* Title generic alert. */
"Generic.Error" = "Jokin meni vikaan. Yritä myöhemmin uudelleen.";

/* Title for generic text to login. */
"Generic.Login" = "Kirjaudu sisään";

/* Title for action to confirm alert. */
"Generic.OK" = "OK";

/* Title for action to retry a failed request. */
"Generic.Retry" = "Yritä uudelleen";

/* Title for error alert if error doesn't contain a description. */
"Generic.ServiceAlert.FallbackTitle" = "Tämä palvelu ei ole tällä hetkellä käytettävissä";

/* Description of the provider capability Checking Accounts. */
"ProviderCapability.CheckingAccounts" = "Käyttötilit";

/* Description of the provider capability Credit Cards. */
"ProviderCapability.CreditCards" = "Luottokortit";

/* Description of the provider capability E-Invoices. */
"ProviderCapability.EInvoices" = "E-laskut";

/* Description of the provider capability Identity Data. */
"ProviderCapability.IdentityData" = "Henkilötiedot";

/* Description of the provider capability Investments. */
"ProviderCapability.Investments" = "Sijoitukset";

/* Description of the provider capability Loans. */
"ProviderCapability.Loans" = "Lainat";

/* Description of the provider capability Mortgage Aggregation. */
"ProviderCapability.MortgageAggregation" = "Kiinnelainojen yhdistäminen";

/* Description of the provider capability Mortgage Loan. */
"ProviderCapability.MortgageLoan" = "Kiinnelaina";

/* Description of the provider capability Payments. */
"ProviderCapability.Payments" = "Maksut";

/* Description of the provider capability Savings Accounts. */
"ProviderCapability.SavingsAccounts" = "Säästötilit";

/* Description of the provider capability Transfers. */
"ProviderCapability.Transfers" = "Siirrot";

/* Description for error when providers could not be loaded. */
"ProviderList.Error.Description" = "Olemme tietoisia tästä virheestä ja pyrimme ratkaisemaan sen. Pyydämme, että olet kärsivällinen ja yrität uudelleen hieman myöhemmin.";

/* Description for error when providers could not be loaded and it is likely it's a temporary error. */
"ProviderList.Error.Temporary" = "Tämä voi olla tilapäinen virhe. Yritä uudelleen ja katso, tapahtuuko virhe uudelleen.";

/* Title for when providers could not be loaded. */
"ProviderList.Error.Title" = "Emme valitettavasti voineet ladata yhtään pankkia tällä kertaa";

/* Placeholder in search field shown in provider list. */
"ProviderList.SearchHint" = "Etsi pankkia tai korttia";

/* Title for list of all providers. */
"ProviderList.Title" = "Valitse pankki";

/* Information text shown in the choose access type screen. */
"SelectAccessType.Information" = "EU:n asetusten vuoksi eri tilityypit on yhdistettävä erikseen.";

/* Title for the other account type (not an open banking account type) on the choose access type screen. */
"SelectAccessType.OtherType" = "Muu";

/* Title of the choose access type screen. */
"SelectAccessType.Title" = "Yhteyden tyyppi";

/* Title for the business authentication user type */
"SelectAuthenticationUserType.Business" = "Yritys";

/* Title for the corporate authentication user type */
"SelectAuthenticationUserType.Corporate" = "Yritys";

/* Title for the personal authentication user type */
"SelectAuthenticationUserType.Personal" = "Henkilökohtainen";

/* Title when picking authentication user type. */
"SelectAuthenticationUserType.Title" = "Kirjautumistyyppi";

/* Title for choose credential type screen. */
"SelectCredentialsType.Title" = "Kirjautumistapa";

/* Description shown for QR code in the supplemental information dialog. */
"SupplementalInformation.QRCodeDescription" = "Avaa Mobile BankID -sovellus ja todenna lukemalla tämä QR-koodi.";

/* Error shown when QR code cannot be fetched/generated/displayed. */
"SupplementalInformation.QRCodeError" = "QR-koodin latauksessa tapahtui virhe. Yritä myöhemmin uudelleen.";

/* Title shown for QR code in the supplemental information dialog. */
"SupplementalInformation.QRCodeTitle" = "Avaa BankID-sovellus";

/* Title for button to submit supplemental information. */
"SupplementalInformation.Submit" = "Lähetä";

/* Title of the supplemental information dialog. */
"SupplementalInformation.Title" = "Lisätiedot";

/* Title for action to download app for third-party app authentication. */
"ThirdPartyAppAuthentication.DownloadAlert.Download" = "Lataa";

